export const newsData = {
    openCup: {
        type: "openCup",
        title: {
            en: "Open cup of the city of Kyiv from the kata",
            ru: "Открытый кубок г. Киева из ката",
            ua: "Відкритий кубок м. Києва з ката",
        },
        date: "29.10.2021",
        category: {
            en: "Competition",
            ru: "Состязание",
            ua: "Змагання ",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701279610/news/291121/news-1_zetxi8.avif",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701279610/news/291121/IMG_1993_li2d4q.avif",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701279610/news/291121/IMG_2265_ceig7w.avif"
        ],
        text1: {
            en: "On October 24, 2021, a traditional tournament took place - the 4th Cup of Kyokushinkai Karate in the \"KATA\" section.",
            ru: "24 октября 2021 года состоялся традиционный турнир - 4-й Кубок Киева с киокушинкой каратэ в разделе «КАТА».",
            ua: "24 жовтня 2021 року відбувся традиційний турнір — 4-й Кубок Києва з кіокушинкай карате у розділі «КАТА»."
        },
        text2: {
            en: "164 athletes from Kyiv and Kyiv region took part in the tournament.",
            ru: "В турнире приняли участие 164 спортсмена Киева и Киевской области.",
            ua: "В турнірі взяли участь 164 спортсмени м.Києва та Київської області.",
        },
        text3: {
            en: "Our won awards:",
            ru: "Наши награды:",
            ua: "Наші здобуті нагороди:",
        },
        wins1: {
            en: ["🥇 Baikalov Ruslan", "🥇 Krymskyi Ivan", "🥇 Kaminska Anna", "🥇 Burak Yevanfia"],
            ru: ["🥇 Байкалов Руслан", "🥇 Крымский Иван", "🥇 Каминская Анна", "🥇 Бурак Еванфия"],
            ua: ["🥇 Байкалов Руслан", "🥇 Кримський Іван", "🥇 Камінська Анна", "🥇 Бурак Єванфія"]
        },
        wins2: {
            en: ["🥈 Lysenko Artem", "🥈 Pravda Timur"],
            ru: ["🥈 Лысенко Артем", "🥈Правда Тимур"],
            ua: ["🥈Лисенко Артем", "🥈 Правда Тимур"]
        },
        wins3: {
            en: ["🥉 Vylenska Vladyslava", "🥉 Kupriyanov Danyil", "🥉 Kolosov Bohdan"],
            ru: ["🥉 Виленская Владислава", "🥉 Куприянов Даниил", "🥉Колосов Богдан"],
            ua: ["🥉 Виленська Владислава", "🥉 Купріянов Даниїл", "🥉 Колосов Богдан"]
        },
        wins4: {
            en: ["🏅 Titorchuk Alexander", "🏅 Valyavsky Maksym", "🏅Butenko Dima"],
            ru: ["🏅 Титорчук Александр", "🏅 Валявский Максим", "🏅 Бутенко Дима"],
            ua: ["🏅 Титорчук Александр", "🏅 Валявський Максим", "🏅 Бутенко Діма"]
        },
        text4: {
            en: "All well done! Kata is part of a fighter's training. We learn kata and do kata at competitions to be stronger 👌🥋",
            ru: "Все молодцы! Ката – это часть тренировки бойца. Учим ката и делаем ката на соревнованиях, чтобы быть сильнее 👌🥋",
            ua: "Всі молодці! Ката — це частина тренування бійця. Вчимо ката та робимо ката на змаганнях, щоб бути сильнішими 👌🥋"
        },
        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
    },
    kumiteMarathon: {
        type: "kumiteMarathon",
        title: {
            en: "Kumite marathon",
            ru: "Кумите марафон",
            ua: "Куміте марафон",
        },
        date: "22.10.2021",
        category: {
            en: "Competition",
            ru: "Состязание",
            ua: "Змагання ",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701280972/news/221021/_-293_grlcv7.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701280970/news/221021/_-42_og4bwp.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701280969/news/221021/_-29_ppeuat.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701280968/news/221021/_-49_vg0kvc.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701280967/news/221021/_-105_n2ejw1.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701280966/news/221021/_-214_csjj9n.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701280965/news/221021/_-315_fblajg.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701280964/news/221021/_-283_rlnllb.jpg"
        ],
        text1: {
            en: "On October 17, the Kumite marathon was held, which was attended by the strongest fighters of the National Kyokushinkai Federation of Ukraine and members of clubs from many parts of the country.",
            ru: "17 октября прошел Кумите марафон, который посетили сильнейшие бойцы Национальной федерации Киокушинкай Украины и участники клубов из многих уголков страны.",
            ua: "17 жовтня пройшов Куміте марафон, який відвідали найсильніші бійці Національної федерації Кіокушинкай України й учасники клубів з багатьох куточків країни."
        },
        text2: {
            en: "20 bouts of 20 minutes each were held. All participants of the marathon showed themselves well!",
            ru: "Были проведены 20 поединков по 20 мин. Все участники марафона показали себя достойно!",
            ua: "Було проведено 20 поєдинків по 20 хв. Всі учасники марафону показали себе достойно!"
        },
        text3: {
            en: "Everyone got a lot of impressions, new acquaintances and energy for the next victories!",
            ru: "Все получили много впечатлений, новых знакомств и энергии на победы!",
            ua: "Всі отримали багато вражень, нових знайомств та енергії на наступні перемоги!"
        },
        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
        text4: "🥋👊🥋👊🥋👊🥋👊🥋👊"
    },
    summerSchool31: {
        type: "summerSchool31",
        title: {
            en: "31st Kyokushinkai Karate Summer School \"Vinnytsia-2021\"",
            ru: "31-я Летняя школа Киокушинкай каратэ «Винница-2021»",
            ua: "31-ша Літня школа Кіокушинкай карате «Вінниця-2021»",
        },
        date: "22.07.2021",
        category: {
            en: "Dojo events",
            ru: "События доджо",
            ua: "Події доджо",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701281626/news/270721/IMG_9277_s1oj2m.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701281624/news/270721/IMG_9377_g72kzq.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701281623/news/270721/IMG_9384_ovout5.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701281622/news/270721/IMG_9386_tprrhb.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701281620/news/270721/IMG_9388_maumht.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701281615/news/270721/IMG_9392_bl0skb.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701281617/news/270721/IMG_9387_uveidt.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701281616/news/270721/IMG_9390_vfryaj.jpg",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701281615/news/270721/IMG_9392_bl0skb.jpg"
        ],
        text1: {
            en: "22.07.21-25.07.21 12 people from the @misakdojo team attended the annual meeting under the leadership of Shikhan Oleksandr Valeryovich Goncharenko - the 31st annual School \"Vinnytsia-2021\".",
            ru: "22.07.21-25.07.21 12 человек команды @misakdojo посетили ежегодное собрание под руководством шихана Гончаренко Александра Валерьевича — 31-летнюю Школу «Винница-2021».",
            ua: "22.07.21-25.07.21 12 людей команди @misakdojo відвідали щорічні збори під керівництвом шихана Гончаренко Олександра Валерійовича — 31-у річну Школу «Вінниця-2021».",
        },
        text2: {
            en: "7 people took part in the examination tests and successfully passed the exams for dan and kyu degrees:",
            ru: "В экзаменационных тестах приняли участие и успешно сдали экзамены на данную степень 7 человек:",
            ua: "В екзаменаційних тестах взяли участь і успішно склали іспити на дан і кю ступені 7 осіб:",
        },
        list: {
            en: "1.Misak Arzumanyan - 2nd dan\n" +
                "2.Felix Zinchenko - 2nd kyu\n" +
                "3.Konstantin Kostyuk - 2nd kyu\n" +
                "4.Maxim Shulyak - 2nd kyu\n" +
                "5.Mykola Ivashkovets - 3rd kyu\n" +
                "6.Mykola Skrypnyk - 8th kyu\n" +
                "7.Rostislav Kushnirenko - 9th kyu",
            ru: "1. Мисак Арзуманян - 2 дан\n" +
                "2. Феликс Зинченко - 2 кю\n" +
                "3. Константин Костюк - 2 кю\n" +
                "4. Максим Шуляк - 2 кю\n" +
                "5. Николай Ивашковец - 3 кю\n" +
                "6. Николай Скрипник - 8 кю\n" +
                "7. Ростислав Кушниренко - 9 кю",
            ua: "1. Місак Арзуманян - 2 дан\n" +
                "2. Фелікс Зінченко - 2 кю\n" +
                "3. Костянтин Костюк - 2 кю\n" +
                "4. Максим Шуляк - 2 кю\n" +
                "5. Микола Івашковец - 3 кю\n" +
                "6. Микола Скрипник - 8 кю\n" +
                "7. Ростислав Кушніренко - 9 кю"
        },
        text3: {
            en: "Goals are achieved. We are moving forward. We overcome difficulties on the path of Kyokushinkai karate and become stronger thanks to our senseis, mentors, like-minded people and the support of loved ones!",
            ru: "Цели достигаются. Мы идем вперед. Преодолеваем трудности на пути Киокушинкай каратэ и становимся сильнее благодаря нашим сенсеям, наставникам, единомышленникам и поддержке близких людей!",
            ua: "Цілі досягаються. Ми йдемо вперед. Долаємо труднощі на шляху Кіокушинкай карате і стаємо сильнішими завдяки нашим сенсеям, наставникам, однодумцям і підтримки близьких людей!"
        },
        text4: {
            en: "To everyone! Kyokushinkai to everyone 🥋✌️",
            ru: "Всем ос! Всем Киокушинкой 🥋✌️",
            ua: "Усім ос! Усім Кіокушинкай 🥋✌️"
        }
    },
    coachDay: {
        type: "coachDay",
        title: {
            en: "Coach's Day is celebrated in Ukraine on July 19",
            ru: "19 июля в Украине отмечают День тренера",
            ua: "19 липня в Україні відзначають День тренера",
        },
        date: "19.07.2021",
        category: {
            en: "Useful Information",
            ru: "Полезная информация",
            ua: "Корисна інформація",
        },
        images: ["https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701282701/news/190721/Screenshot_1_hhkc1a.png"],
        text1: {
            en: "July 19 is officially celebrated as a professional holiday in Ukraine — Coach's Day. 🥋\n" +
                "\n" +
                "The MISAKDOJO team congratulates all senseis — mentors of Kyokushin Karate. 🥋\n" +
                "\n" +
                "Wishing you creative inspiration, enthusiasm, energy, and confidence in tomorrow. 💫",
            ru:
                "19 июля в Украине официально отмечается профессиональный праздник — День тренера. 🥋\n" +
                "\n" +
                "Команда MISAKDOJO поздравляет всех сэнсеев — наставников Киокушинкай Карате. 🥋\n" +
                "\n" +
                "Творческого вдохновения, энтузиазма, энергии и уверенности в завтрашнем дне. 💫",
            ua:
                "19 липня в Україні офіційно відзначають професійне свято — День тренера.🥋\n" +
                "\n" +
                "Команда MISAKDOJO вітає всіх сенсеїв — наставників Кіокушинкай Карате.🥋\n" +
                "\n" +
                "Творчого натхнення, ентузіазму, енергії та впевненості у завтрашньому дні.💫"
        }
    },
    childTraining: {
        type: "childTraining",
        title: {
            en: "Where to send the child for training? Kyokushinka karate!",
            ru: "Куда отдать ребенка на тренировку? Киокушинка каратэ!",
            ua: "Куди віддати дитину на тренування? Кіокушинкай карате!",
        },
        images: ["https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701287335/news/130419/11_-_Misakdojo_team__v6ackr.jpg"],
        date: "09.10.2020",
        category: {
            en: "Useful Information",
            ru: "Полезная информация",
            ua: "Корисна інформація",
        },
        text: {
            en: "Where to enroll a child for training? 💭 Kyokushin Karate! 💡\n" +
                "\n" +
                "💪 Because KYOKUSHIN KARATE is the path of spiritual strength!\n" +
                "💪 Character comes first!\n" +
                "💪 Real contact in combat — COURAGE AND RESILIENCE!\n" +
                "💪 Code of conduct — DISCIPLINE AND MODESTY!\n" +
                "💪 Effective self-defense — CONFIDENCE AND READINESS!\n" +
                "💪 Caring for children's health!\n" +
                "\n" +
                "The Kyokushin Karate school \"Misak Dojo\" invites children from 4 years old to join our classes!\n" +
                "\n" +
                "Join us and become part of the friendly team of karate practitioners at \"Misak Dojo\"! Train in a modern dojo, develop the strength and spirit of a true warrior!\n" +
                "\n" +
                "Osu!",
            ru: "Куда отдать ребенка на тренировку? 💭 Киокушинкай карате! 💡\n" +
                "\n" +
                "💪 Потому что КИОКУШИНКАЙ КАРАТЕ — это путь силы духа!\n" +
                "💪 На первом месте — ХАРАКТЕР!\n" +
                "💪 Реальный контакт в поединке — СМЕЛОСТЬ И УСТОЙЧИВОСТЬ!\n" +
                "💪 Кодекс поведения — ДИСЦИПЛИНА И СКРОМНОСТЬ!\n" +
                "💪 Эффективная самозащита — УВЕРЕННОСТЬ И ГОТОВНОСТЬ!\n" +
                "💪 Забота о здоровье детей!\n" +
                "\n" +
                "Школа киокушинкай карате \"Мисак доджо\" приглашает на занятия детей от 4-х лет!\n" +
                "\n" +
                "Присоединяйся к нам и стань частью дружной команды каратистов \"Мисак дожо\"! Занимайся в современном доджо, развивай силу и дух настоящего воина!\n" +
                "\n" +
                "Осу!",
            ua: "Куди віддати дитину на тренування?💭 Кіокушинкай карате! 💡\n" +
                "\n" +
                "💪Тому що КІОКУШИНКАЙ КАРАТЕ — це шлях сили духу!\n" +
                "💪 На першому місці — ХАРАКТЕР!\n" +
                "💪 Реальний контакт в поєдинку — СМІЛИВІСТЬ ТА СТІЙКІСТЬ!\n" +
                "💪 Кодекс поведінки — ДИСЦИПЛІНА ТА СКРОМНІСТЬ!\n" +
                "💪 Ефективний самозахист — ВПЕВНЕНІСТЬ ТА ГОТОВНІСТЬ!\n" +
                "💪Турбота про здоров'я дітей!\n" +
                "\n" +
                "Школа кіокушинкай карате «Місак доджо» запрошує на заняття дітей від 4-х років!\n" +
                "\n" +
                "Приєднуйся до нас та ставай частиною дружної команди каратистів «Місак дожо»! Займайся в сучасному доджо, розвивай силу та дух справжнього воїна!\n" +
                "\n" +
                "Осу!"
        },
    },
    karateDay: {
        type: "karateDay",
        title: {
            en: "October 7 is World Karate Day",
            ru: "7 октября - Всемирный день каратэ",
            ua: "7 жовтня — Всесвітній день карате",
        },
        date: "07.10.2020",
        category: {
            en: "Useful Information",
            ru: "Полезная информация",
            ua: "Корисна інформація",
        },
        images: ["https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701283449/news/071020/IMG_4392_ic4fsj.jpg"],
        text: {
            en: "Today, October 7th, is World Karate Day, also known as \"K Day.\"\n" +
                "\n" +
                "We believe that the Spirit of Karate unites everyone who wears a karategi!\n" +
                "\n" +
                "The Kyokushin Karate Sports Club \"Misak Dojo\" extends greetings to all those on the Karate path!\n" +
                "\n" +
                "May today bring us even more strength and confidence!\n" +
                "\n" +
                "Stay true to the chosen Path!\n" +
                "\n" +
                "Osu!\n" +
                "\n" +
                "Kyokushin Karate Sports Club \"Misak Dojo\"",
            ru:
                "Сегодня, 7 октября, Всемирный день карате, также известный как \"День К\" (Карате-день).\n" +
                "\n" +
                "Мы верим, что Дух карате объединяет всех, кто носит каратеги!\n" +
                "\n" +
                "Спортивный клуб Киокушинкай карате \"Мисак доджо\" поздравляет всех, кто следует пути Карате!\n" +
                "\n" +
                "Пусть сегодняшний день приносит нам еще больше сил и уверенности!\n" +
                "\n" +
                "Будьте верны выбранному Пути!\n" +
                "\n" +
                "Осу!\n" +
                "\n" +
                "СККК \"Мисак доджо\"",
            ua:
                "Сьогодні, 7 жовтня, Всесвітній день карате, також відомий як \"День К\" (К-day).\n" +
                "\n" +
                "Ми віримо, що Дух карате об'єднує всіх, хто одягається в каратегі! \n" +
                "\n" +
                "Спортивний клуб Кіокушинкай карате «Місак доджо» вітає всіх, хто на шляху Карате!\n" +
                "\n" +
                "Нехай сьогоднішній день надає нам ще більше сил і впевненості!\n" +
                "\n" +
                "Будьте вірні обраному Шляху!\n" +
                "\n" +
                "Осу!\n" +
                "\n" +
                "СККК «Місак доджо»"
        }
    },
    meaningTerm: {
        type: "meaningTerm",
        title: {
            en: "The meaning of the term \"Osu\"",
            ru: "Значение термина «Осу»",
            ua: "Значення терміну «Осу»",
        },
        date: "22.09.2019",
        category: {
            en: "Useful Information",
            ru:
                "Полезная информация",
            ua:
                "Корисна інформація",
        }
        ,
        images: ["https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701283986/news/220919/Screenshot_38_mesnq9.png"],
        text: {
            en: "In Kyokushin Karate, the answer to every question is 'Osu.' Every greeting is 'Osu.' In response to each instruction or question in class, the answer is 'Osu' instead of 'yes' or 'I understand.' When performing kihon waza (basic techniques) in class, each technique is often accompanied by a loud 'Osu.' When practicing jiu kumite (full-contact sparring) in class, and your opponent uses a good, complex technique, you say 'Osu' to acknowledge your opponent's skill. As a sign of respect, fighters at a tournament bow and say 'Osu' to the front, the referee, and each other, before and after the fight.\n" +
                "\n" +
                "<strong>Osu</strong> is a combination of the words Oshi, meaning 'push,' and Shinobu, which means 'endure.' <strong>Osu</strong> signifies patience, determination, gratitude, respect, and perseverance.\n" +
                "\n" +
                "\n" +
                "To develop a strong body and a strong spirit, one must undergo challenging training. Kyokushin training is very demanding. You become demanding of yourself until you decide that you have reached your limit. Initially, your body wants to stop, give up, but your mind continues to push you. Then your mind wants to stop, but your spirit supports you. When you reach this point, you must fight with yourself and your weakness, and you must overcome. To do this, you must endure pain, learn to stand on your own, but above all, you must learn to be patient. This is <strong>Osu!</strong>\n" +
                "\n" +
                "Kyokushin Karate is not learned instantly. It takes years to properly learn the basics. Basic techniques are performed thousands of times (ren ma — 'always polishing') until they are performed reflexively or instinctively, without conscious thought (mushino — 'mind without mind'). There is no need to be disheartened, doing the same thing over and over again, especially when progress seems slow. To overcome this disappointment and continue learning, patience and determination are required. This is <strong>Osu.</strong>\n" +
                "\n" +
                "The reason you subject yourself to challenging training is because you care about yourself, and taking care of yourself means respecting yourself. Self-respect needs to be cultivated so that it extends as respect for the teacher and classmates. When you enter the dojo, you bow and say 'Osu.' This means you respect your dojo and the time you spend there. This feeling of respect is <strong>Osu!</strong>\n" +
                "\n" +
                "During training, you exert yourself because you respect yourself. When you finish, you bow to your instructor and classmates and say 'Osu' again. You do this with gratitude. This feeling of gratitude is <strong>Osu.</strong>\n" +
                "\n" +
                "Thus, Osu is a very important word in Kyokushin Karate because it signifies patience, respect, and value. That's why we always use the word 'Osu' to remind ourselves of these indispensable qualities. True dedication, necessary to walk the path of Kyokushinkai, is <strong>Osu!</strong>\n" +
                "\n" +
                "Misak Arzumanyan",
            ru:
                "В Киокушинкай карате на каждый вопрос отвечают «Осу». Каждое приветствие — это «Осу». На каждую инструкцию или вопрос в классе отвечают «Осу» вместо «да» или «я понимаю». При выполнении кихон ваза (базовых техник) в классе, каждая техника часто сопровождается громким «Осу». Когда вы практикуете джиу кумите (полностью свободный бой) в классе, и ваш оппонент использует хорошую, сложную технику, вы говорите «Осу», чтобы признать мастерство оппонента. В знак уважения бойцы на турнире кланяются и говорят «Осу» фронту, рефери и друг другу, до и после боя.\n" +
                "\n" +
                "<strong>Osu</strong> — это сочетание слов Oshi, что означает «толчок», и Shinobu, которое означает «терпеть». <strong>Osu</strong> означает терпение, решимость, благодарность, уважение и настойчивость.\n" +
                "\n" +
                "\n" +
                "Чтобы развить сильное тело и сильный дух, необходимо пройти сложные тренировки. Тренировки киокушин очень требовательны. Вы становитесь требовательными к себе, пока не решите, что достигли своей границы. Сначала ваше тело хочет остановиться, сдаться, но ваш разум продолжает подталкивать вас. Тогда ваш разум хочет остановиться, но ваш дух поддерживает вас. Когда вы достигнете этой точки, вы должны бороться с собой и своей слабостью, и вы должны победить. Чтобы сделать это, вы должны терпеть боль, вы должны научиться стоять на своем, но, прежде всего, вы должны научиться быть терпеливым. Это <strong>Osu!</strong>\n" +
                "\n" +
                "Киокушин карате не изучается сразу. Нужны годы, чтобы правильно изучить основы. Основные техники выполняются тысячи раз (рен ма — «всегда полировка»), пока они не будут выполнены рефлексом или инстинктом, без осознанного мышления (мушіно — «разум без разума»). Не нужно унывать, делая одно и то же снова и снова, особенно когда прогресс кажется медленным. Чтобы преодолеть это разочарование и продолжить обучение, нужно терпение и решимость. Это <strong>Osu.</strong>\n" +
                "\n" +
                "Причина, по которой вы подвергаете себя тяжелым тренировкам, заключается в том, что вы заботитесь о себе, а заботиться о себе — значит уважать себя. Самоуважение нужно развивать, чтобы оно распространялось как уважение к преподавателю и однокурсникам. Когда вы входите в доджо, вы кланяетесь и говорите «Osu». Это означает, что вы уважаете свое доджо и время, которое вы проводите там. Это чувство уважения — это <strong>Osu!</strong>\n" +
                "\n" +
                "Во время тренировок вы изо всех сил стараетесь, потому что уважаете себя. Когда вы заканчиваете, вы кланяетесь своему инструктору и однокурсникам, и снова говорите «Osu». Вы делаете это с благодарностью. Это чувство благодарности — это <strong>Osu.</strong>\n" +
                "\n" +
                "Таким образом, Osu является очень важным словом в Киокушин карате, потому что означает терпение, уважение и ценность. Вот почему мы всегда используем слово «Osu», чтобы напомнить себе о этих незаменимых качествах. Истинное посвящение, необходимое для того, чтобы идти по пути Киокушинкай — это <strong>Osu!</strong>\n" +
                "\n" +
                "Мисак Арзуманян",
            ua:
                "У Кіокушинкай карате на кожне питання відповідають «Осу». Кожне вітання — це «Осу». На кожну інструкцію або питання в класі відповідають «Осу» замість «так» або «я розумію». При виконанні кіхон ваза (базових технік) в класі, кожна техніка часто супроводжується гучним «Осу». Коли ви практикуєте джиу куміте (повністю вільний бій) в класі, і ваш опонент використовує хорошу, складну техніку, ви говорите «Осу», щоб визнати майстерність опонента. В якості прояву поваги бійці на турнірі кланяються і говорять «Осу» фронту, рефері та один одному, до і після бою.\n" +
                "\n" +
                "<strong>Osu</strong> — це поєднання слів Oshi, що означає «поштовх», і Shinobu, яке означає «терпіти». <strong>Osu</strong> означає терпіння, рішучість, вдячність, повагу і наполегливість. \n" +
                "\n" +
                "\n" +
                "Щоб розвити сильне тіло і сильний дух, необхідно пройти складні тренування. Тренування кіокушин дуже вимогливі. Ви стаєте вимогливими до себе, поки не вирішите, що досягли своєї межі. Спочатку ваше тіло хоче зупинитися, здатися, але ваш розум продовжує підштовхувати вас. Тоді ваш розум хоче зупинитися, але ваш дух підтримує вас. Коли ви досягнете цієї точки, ви повинні боротися з собою і своєю слабкістю, і ви повинні перемогти. Щоб зробити це, ви повинні терпіти біль, ви повинні навчитися стояти на своєму, але, перш за все, ви повинні навчитися бути терплячим. Це <strong>Осу!</strong>\n" +
                "\n" +
                "Кіокушин карате не вивчається відразу. Потрібні роки, щоб правильно вивчити основи. Основні техніки виконуються тисячі разів (рен ма — «завжди полірування»), поки вони не будуть виконані рефлексом або інстинктом, без усвідомленого мислення (мушіно — «розум без розуму»). Не потрібно засмучуватися, роблячи одне і те ж знову і знову, особливо коли прогрес здається повільним. Щоб подолати це розчарування і продовжити навчання, потрібно терпіння і рішучість. Це  <strong>Осу.</strong>\n" +
                "\n" +
                "Причина, за якою ви піддаєте себе важким тренуванням, полягає в тому, що ви дбаєте про себе, а піклуватися про себе — значить поважати себе. Самоповагу потрібно розвивати, щоб вона поширювалася як повага до викладача й однокурсників. Коли ви входите в доджо, ви кланяєтеся і говорите «Осу». Це означає, що ви поважаєте своє доджо і час, який ви проводите там. Це почуття поваги є <strong>Осу!</strong>\n" +
                "\n" +
                "Під час тренувань ви щосили стараєтеся, тому що поважаєте себе. Коли ви закінчуєте, ви кланяєтеся своєму інструкторові й однокурсникам, і знову говорите «Осу». Ви робите це з подяки. Це почуття вдячності є <strong>Осу.</strong>\n" +
                "\n" +
                "Таким чином, Осу є дуже важливим словом в Кіокушин карате, тому що означає терпіння, повагу і цінність. Ось чому ми завжди використовуємо слово «Осу», щоб нагадати собі про ці незамінні якості. Справжня відданість, необхідна для того, щоб йти шляхом Кіокушинкай — це <strong>Осу!</strong>\n" +
                "\n" +
                "Місак Арзуманян"
        }
    },
    summerSchool32: {
        type: "summerSchool32",
        title: {
            en: "32nd Kyokushinkai Karate Summer School \"Vinnytsia 2019\"",
            ru: "32-я Летняя школа Киокушинкай каратэ «Винница 2019»",
            ua: "32-ша Літня школа Кіокушинкай карате «Вінниця 2019»",
        },
        date: "12.08.2019",
        category: {
            en: "Dojo events",
            ru: "События доджо",
            ua: "Події доджо",
        }
        ,
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701285606/news/120819/Screenshot_1_bfmgjy.png",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701285604/news/120819/Screenshot_36_yp5pgv.png",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701285544/news/120819/Screenshot_37_jqao3d.png"
        ],
        text1: {
            en: "They visited the 32nd Kyokushinkai Karate Summer School under the leadership of Shikhan Honcharenko Oleksandr Valeriyovych.",
            ru: "Посетили 32-ю летнюю школу Киокушинкай каратэ под руководством шихана Гончаренко Александра Валерьевича.",
            ua: "Відвідали 32-гу Літню школу Кіокушинкай карате під керівництвом шихана Гончаренко Олександра Валерійовича.",
        },
        text2: {
            en: "Our students have passed exams and advanced to the following student ranks:\n" +
                "\n" +
                "● Felix Zinchenko — <strong>4th kyu</strong>\n" +
                "● Olya Timofeeva — <strong>8th kyu</strong>\n" +
                "● Olena Koval — <strong>8th kyu</strong>\n" +
                "● Dima Kravchenko — <strong>9th kyu</strong>",
            ru:
                "Наши ученики сдали экзамены и перешли на следующие ученические уровни:\n" +
                "\n" +
                "● Феликс Зинченко — 4 кю\n" +
                "● Оля Тимофеева — 8 кю\n" +
                "● Eлена Коваль — 8 кю\n" +
                "● Дима Кравченко — 9 кю",
            ua:
                "Наші учні здали екзамени і перейшли на наступні учнівські ступені:\n" +
                "\n" +
                "● Фелікс Зінченко — 4 кю\n" +
                "● Оля Тимофеєва — 8 кю\n" +
                "● Олена Коваль — 8 кю\n" +
                "● Діма Кравченко — 9 кю",
        },
        text3: {
            en: "Thank you, shihan, all senseis, and sempais! See you at the next sessions!\n" +
                "\n" +
                "Osu!",
            ru: "Благодарим шихана, всех сэнсеев и сэмпаев! До встречи на следующих занятиях!\n" +
                "\n" +
                "Осу!",
            ua: "Дякуємо шихану, всім сенсеям та семпаям! До зустрічі на наступних школах!\n" +
                "\n" +
                "Осу!"
        }
    },
    championship: {
        type: "championship",
        title: {
            en: "Zhytomyr Oblast Kyokushinkai Karate Championship",
            ru: "Чемпионат Житомирской области по Киокушинкай карате",
            ua: "Чемпіонат Житомирської області із Кіокушинкай карате",
        },
        date: "13.04.2019",
        category: {
            en: "Competition",
            ru: "Состязание",
            ua: "Змагання",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701286096/news/130419/Screenshot_33_zhh2qh.png",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1701286093/news/130419/Screenshot_32_o3xupq.png"
        ],
        text1: {
            en: "The results of the students of the Sports Club \"Misak Dojo\" at the Open Championship of the Zhytomyr region in Kyokushinkai karate, which was held on April 6 in the city of Novohrad-Volynskyi.",
            ru: "Результаты учащихся Спортивного клуба «Мисак Доджо» на Открытом чемпионате Житомирской области по Киокушинкай каратэ, который прошел 6 апреля в г. Новоград-Волынский.",
            ua: "Результати учнів Спортивного клубу «Місак Доджо» на Відкритому чемпіонаті Житомирської області з Кіокушинкай карате, який пройшов 6 квітня в м. Новоград-Волинський.",
        },
        text2: {
            en: "Congratulations to our karatekas on their victories:\n" +
                "\n" +
                "● Lera Slipets — 1st place\n" +
                "● Dima Boyko — 2nd place",
            ru:
                "Поздравляем наших каратистов с победами:\n" +
                "\n" +
                "● Лера Сліпець — 1 место\n" +
                "● Дима Бойко — 2 место",
            ua:
                "Вітаємо наших каратистів з перемогами:\n" +
                "\n" +
                "● Лера Сліпець — 1 місце\n" +
                "● Діма Бойко — 2 місце"
        },
        text3: {
            en: "500 karatekas from 14 clubs across 6 regions of Ukraine participated in the competition. It was a fantastic opportunity to test their techniques and gain invaluable experience!\n" +
                "\n" +
                "Osu!",
            ru: "В соревнованиях приняли участие 500 каратистов из 14 клубов 6 областей Украины. Отличная возможность проверить свою технику и получить колоссальный опыт!\n" +
                "\n" +
                "Осу!",
            ua: "У змаганнях взяли участь 500 каратистів 14 клубів з 6 областей України. Чудова можливість перевірити свою техніку і отримати колосальний досвід!\n" +
                "\n" +
                "Осу!"
        }
    },
    cherkasyOblastCup: {
        type: "cherkasyOblastCup",
        title: {
            en: "Cherkasy Oblast Cup",
            ru: "Кубок Черкасской области",
            ua: "Кубок Черкаської області",
        },
        date: "19.03.2019",
        category: {
            en: "Competition",
            ru: "Состязание",
            ua: "Змагання",
        },
        images: ["https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702367349/news/190319/Screenshot_32_t0gx3n.webp",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702367347/news/190319/Screenshot_29_p8xvgy.webp",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702367347/news/190319/Screenshot_30_syjtrj.webp"
        ],
        text1: {
            en: "This weekend, the sports club \"Misak Dojo\" took part in the Open Championship of the Cherkasy Region in Kyokushin Karate 🥋",
            ru: "В эти выходные Спортивный клуб «Мисак Доджо» принял участие в Открытом чемпионате Черкасской области по Киокушинкай карате 🥋",
            ua: "На цих вихідних Спортивний клуб «Місак Доджо» взяв участь у Відкритому чемпіонаті Черкаської області з Кіокушинкай карате 🥋"
        },
        text2: {
            en: "Here are the results: Yaroslav Hryshchenko — gold🥇, Mykyta Kampov — silver🥈, Artem Tymofieiev — bronze🥉.",
            ru: "У нас следующие результаты: Ярослав Гринченко — золото🥇, Никита Кампов — серебро🥈, Артем Тимофеев — бронза🥉.",
            ua: "Маємо такі результати: Ярослав Грінченко — золото🥇, Микита Кампов — срібло🥈, Артем Тимофеєв — бронза🥉."
        },
        text3: {
            en: "The guys competed with karatekas from 16 teams across 6 regions of Ukraine. We take pride in their achievements, which would have been impossible without the support and efforts of parents. Thank you for your help and trust! 🙏",
            ru: "Парни сражались с каратистами из 16 команд 6 областей Украины. Мы гордимся их достижениями, которые были бы невозможны без поддержки и усилий родителей. Спасибо вам за помощь и доверие! 🙏",
            ua: "Хлопці боролися з каратистами 16 команд з 6 областей України. Ми пишаємося їх досягненнями, які були б неможливими без підтримки та зусиль батьків. Дякуємо вам за допомогу та довіру!🙏"
        },
        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
    },
    fighterCup: {
        type: "fighterCup",
        title: {
            en: "SC \"Fighter\" Open Cup 2019",
            ru: "Открытый кубок СК «Файтер» 2019",
            ua: "Відкритий кубок СК «Файтер» 2019",
        },
        date: "10.03.2019",
        category: {
            en: "Competition",
            ru: "Состязание",
            ua: "Змагання ",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702369448/news/100319/Screenshot_25_jbnpoy.webp",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702369450/news/100319/Screenshot_26_rvzupe.webp",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702369451/news/100319/Screenshot_27_cxd7ig.webp"
        ],
        text1: {
            en: "Today, the team of young but confident karatekas from the \"Misak Dojo\" club participated in the SK \"Fighter\" Cup for children aged 6-8 in kumite and kata categories.",
            ru: "Сегодня команда маленьких, но уверенных каратистов клуба \"Мисак Доджо\" приняла участие в Кубке СК \"Файтер\" для детей в возрасте 6-8 лет в дисциплинах кумитэ и ката.",
            ua: "Сьогодні команда маленьких, але впевнених каратистів клубу «Місак Доджо» взяла участь у Кубку С К «Файтер» для дітей віком 6 — 8 років в розділі куміте і ката."
        },
        text2: {
            en: "The fights were intense and spectacular. Here are the results we got:",
            ru: "Поединки были насыщенными и зрелищными. Вот такие результаты мы получили:",
            ua: "Поєдинки були насиченими та видовищними. Ось такі результати ми отримали:",
        },
        wins1: {
            en: [
                "🥇 Artem Timofeev - 1st place", "🥇 Maxim Loginov - 1st place",
                "🥈 Danilo Kaybal - 2nd place", "🥈 Ivan Maltsev - 2nd place",
                "🥉 Oleg Svitlychnyi - 3rd place", "🏅 Yaroslav Hryshchenko - 4th place",
                "🏅 Artem Tikhostup - 4th place", "🏅 Artem Timofeev opens the list of kumite champions and closes the list with kata - 4th place"
            ],
            ru: [
                "🥇 Артем Тимофеев - 1 место", "🥇 Максим Логинов - 1 место",
                "🥈 Данило Кейбал - 2 место", "🥈 Иван Мальцев - 2 место",
                "🥉 Олег Свитличный - 3 место", "🏅 Ярослав Гринченко - 4 место",
                "🏅 Тихоступ Артем - 4 место", "🏅 Артем Тимофеев открывает список чемпионов по кумите и закрывает список разделом ката - 4 место"],
            ua: [
                "🥇 Артем Тимофеєв - 1 місце", "🥇 Максим Логінов - 1 місце",
                "🥈 Данило Кейбал - 2 місце", "🥈 Іван Мальцев - 2 місце",
                "🥉 Олег Світличний - 3 місце", "🏅 Ярослав Грінченко - 4 місце",
                "🏅 Тихоступ Артем - 4 місце", "🏅 Артем Тимофеєв відкрив список чемпіонів з куміте і закриває список розділом ката - 4 місце"
            ]
        },
        text3: {
            en: "Briefly about each:",
            ru: "Кратко о каждом:",
            ua: "Коротко про кожного:",
        },
        text4: {
            en: "Artem 😎 As always, confidently and swiftly paved his way to the first place and again ... achieved the victory! Great job, Toma! Keep it up! But we don't relax! Ahead are many more tournaments and many strong opponents with whom it won't be easy, but you'll handle it!",
            ru: "Артем 😎 Как всегда, уверенно и стремительно продвигался к первому месту и снова ... достиг первенства! Тема молодец! Так держать! Но не расслабляемся! Впереди еще много турниров и много сильных соперников, с которыми будет нелегко, но ты справишься!",
            ua: "Артем😎Як завжди, впевнено і стрімко пробивав собі дорогу до першого місця і знову … отримав першість! Тьома молодець! Так тримати! Але не розслабляємося! Попереду ще багато турнірів і багато сильних суперників з якими буде нелегко, але ти справишся!"
        },
        text5: {
            en: "Max 🧐 Max did not qualify for kumite based on age (our Max is no longer 8 but a whole 9), but he didn't miss the opportunity and successfully debuted in kata! Technically and precisely executing each move, Max didn't give the judges a chance to deny him the first place — a true gentleman! Max is now preparing for kumite in Uman!",
            ru: "Макс 🧐 Максим не попал в кумитэ по возрасту (нашему Максиму уже далеко не 8, а целых 9), но не упустил возможности и успешно дебютировал в кате! Технично и четко выполнив каждое движение, Максим не дал судьям отказать ему в первом месте — настоящий джентльмен! Максим готовится теперь к кумитэ в Умань!",
            ua: "Макс 🧐Макс не потрапив в куміте за віком (вже далеко не 8 нашому Максу, а цілих 9), але не втратив можливості та успішно дебютував у ката! Технічно і чітко виконавши кожен рух, Макс не дав можливості суддям відмовити йому у першому місці — джентльмен! Макс готується тепер на куміте в Умань!",
        },
        text6: {
            en: "Danilo Kaybal 🤓 Danilo defended himself as best he could, but the opponent in the final proved to be persistent and eventually landed a mawashi on our karateka. Danilo tried various techniques, but time in the round is limited, and the mawashi came at the very end. Overall, Danilo missed the mawashi, and along with it, the first place. But it's okay, Danilo, you are strong. Just this time, you fell a bit short, but you fought with confidence. We'll keep working and use more leg techniques in the future.",
            ru: "Данило Кейбал 🤓 Данило отбивался от всех, как мог, но соперник в финале оказался настойчивым и, в конце концов, всё-таки попал маваши нашему каратисту. Данило старался изо всех сил, но время в раунде ограничено, и маваши пришёл в самом конце. В итоге Данилко уступил маваши, а вместе с ним и первое место. Но ничего, Данило, ты сильный. Просто на этот раз немного не хватило, но ты дрался уверенно. Будем работать дальше и больше использовать ноги.",
            ua: "Данило Кейбал 🤓 Данило відкейбив усіх як міг, але суперник у фіналі виявився наполегливим і в кінці все-таки влупив маваші нашому каратисту. Як тільки Данило не молотив його руками, але час в раунді обмежений і маваші був у самому кінці. Загалом, Данилко пропустив маваші, а з ним і перше місце. Але нічого, Данило, ти сильний. Просто цього разу трохи не дотягнув, але бився впевнено. Працюватимемо далі і більше використовуватимемо ноги.",
        },
        text7: {
            en: "Oleg 🤔 What happened with Oleg today, we don't know, but he gracefully lost the first match. However, he redeemed himself later. Oleg, you can do it! But probably today wasn't your day. But don't worry. You're a man, we know that. You're strong, and we know that! So keep pushing the karatekas in kumite as you should, and we look forward to the next competition!",
            ru: "Oleg 🤔 Что произошло сегодня с Олегом, мы не знаем, но первый бой он удачно проиграл. Но потом реабилитировался. Олег, ты можешь, умеешь! Но, вероятно, сегодня был не твой день. Но ничего, не расстраивайся. Ты мужчина, мы это знаем. Ты силач, и это мы знаем! Так что еще погоняешь каратистов в кумите как следует, поэтому ждем следующих соревнований!",
            ua: "Олег 🤔 Що сталося сьогодні з Олегом, не знаємо, але перший бій він благополучно злив. Але потім реабілітувався. Олеже, можеш, умієш! Але напевно сьогодні був не твій день. Але нічого, не засмучуйся. Ти мужчинчик, ми це знаємо. Ти силач і це ми знаємо! Так що ще поганяєш каратистів в куміте як слід, тому чекаємо наступні змагання!",
        },
        text8: {
            en: "Ivan Maltsev 🤠 In the first competition, Ivan lost but learned a valuable lesson. And this lesson paid off in these competitions — Ivan secured the second place. Ivan fought excellently! Technically, using various techniques. Overall, he showed class: well done!",
            ru: "Иван Мальцев 🤠 На первых соревнованиях Иван проиграл, но получил ценный урок. И этот урок принес результаты на этих соревнованиях — Иван занял второе место. Иван сражался отлично! Технично, используя разнообразные приемы. В целом, показал класс: мо-ло-дeц!",
            ua: "Іван Мальцев 🤠 Перше змагання Іван програв, але отримав цінний урок. І цей урок приніс результати на цих змаганнях, — Іван отримав друге місце. Бився Іван відмінно! Технічно, використовуючи різноманітні товари. Загалом показав клас: мо-ло-дець!",
        },
        text9: {
            en: "Yarik 🤯 Yarik had a tough time this time, but he held his own! He wanted to win, really wanted! Yarik fought. Fought cleanly, combining precise and powerful punches with targeting low kicks. He had a plan. But the opponent was big and technically advanced; it was hard to get in to execute a clean valsa-ari. Let's consider this a warm-up before the competitions in Uman next week. There, Yarik will show his class! Beware, Yarik is heading to Uman!",
            ru: "Ярик 🤯 В этот раз Ярику пришлось нелегко, но он держался молодцом! Он хотел победить, очень хотел! Ярик боролся. Боролся четко, комбинируя ясные и сильные удары руками и используя лоукик. У него был план. Но противник был крупный и технически развит, трудно было пробиться, чтобы сработать чисто на вальза-ари. Давайте считать это разминкой перед соревнованиями в Умани на следующей неделе. Там Ярик покажет класс! Берегитесь, Ярик едет в Умань!",
            ua: "Ярік 🤯 Яріку довелося цього разу нелегко, але він тримався молодцем! Він хотів перемогти, дуже хотів! Ярік бився. Бився чітко, комбінуючи чіткі та сильні удари руками та вицілюючи лоукік. Бив має. Але супротивник був великий та технічно розвинений, важко було підступитися, щоб спрацювати чисто на валза-арі. Будемо вважати це розминкою перед змаганнями в Умані наступного тижня. Там Ярік покаже клас! Бережіться, Ярік їде до Умані!",
        },
        text10: {
            en: "Artemchik Tikhostup, Zakhar — we train, we train, and train again!",
            ru: "Артемчик Тихоступ, Захар — тренируемся, тренируемся и еще раз тренируемся!",
            ua: "Артемчик Тихоступ, Захар, — тренуємося, тренуємося та ще раз тренуємося!",
        },
        text11: {
            en: "Your strike is your weapon, which will serve you in battle. Therefore, your task, karatekas, is to train the strike as a strike, not just swinging your legs and arms. Think about how you will win in competitions, and try to make your strikes as powerful as possible during training!\n" +
                "\n" +
                "In our dojo, there are many strong karatekas. The guys train and strive, so they succeed. Remember that it all depends on you, so be brave! You have someone to train with. Everything will work out; it's a matter of time and training. All conditions are created for training. And competitions are a test of how you train!\n" +
                "\n" +
                "It's simple: defeat means you train too little or poorly, victory means training is beneficial, and you are developing.\n",
            ru: "Твой удар — твое оружие, которое тебе пригодится в бою. Поэтому вашей задачей, каратисты, является тренировка удара как удара, а не просто размахивания ногами и руками. Подумайте о том, как вы будете побеждать на соревнованиях, и старайтесь делать удары на тренировках максимально сильными!\n" +
                "\n" +
                "В нашем зале много сильных каратистов. Парни тренируются и стараются, поэтому у них всё получается. Помните, что всё зависит только от вас, поэтому будьте смелыми! У вас есть с кем тренироваться. Всё получится, это вопрос времени и тренировок. Все условия созданы для тренировок. А соревнования — это проверка того, как вы тренируетесь!\n" +
                "\n" +
                "Всё просто: поражение означает, что мало и плохо тренируетесь, победа — тренировки проходят с пользой, и вы развиваетесь.\n",
            ua: "\n" +
                "Твій удар — твоя зброя, яка тобі знадобиться у бою. Тому, вашим завданням, каратисти, є тренування удару як удару, а не просто розмахування ногами і руками. Думайте про те, як ви будете перемагати на змаганнях та старайтеся робити удари на тренуваннях максимально сильно!\n" +
                "\n" +
                "У нашому залі багато сильних каратистів. Хлопці тренуються та стараються, тому у них все виходить. Пам’ятайте, що все залежить тільки від вас, тому будьте сміливими! Вам є з ким тренуватися. Все вийде, це справа часу та тренувань. ВСі умови створені для тренувань. А змагання — це перевірка того, як ви тренуєтеся!\n" +
                "\n" +
                "Все просто: програш означає, що мало та погано тренуєтеся, виграш — тренування проходять з користю і ви розвиваєтеся.\n",
        },
        text12: {
            en: "Matviy debuted! The little fighter who eagerly entered the battle had to experience many emotions and excitement, but Matviy handled them and stepped onto the tatami to fight! And how he fought, how he competed! Defeated in the battle, but not broken in spirit, Matviy will continue training to keep fighting and winning! Congratulations to Matviy on his first competition! Ahead, there will be even more victories and emotions!",
            ru: "Дебютировал Матвей! Маленькому бойцу, который рвался в бой, пришлось пережить много эмоций и волнений, но Матвей справился и вышел на татами биться! И как он бил, как он сражался! Побежден в бою, но не сломленный духом, Матвей будет тренироваться, чтобы дальше бороться и побеждать! Поздравляем Матвея с первым соревнованием! Впереди еще больше побед и эмоций!",
            ua: "Дебютував Матвій! Маленькому бійцю, що рвався у бій довелося пережити багато емоцій та хвилювань, але Матвій з ними справився та вийшов на татамі битися! А як він бив, як він змагався! Переможений в бою, але не повалений духом, Матвій буде тренуватися, щоб далі битися і перемагати! Вітаємо Матвія з першим змаганням! Попереду ще більше перемог та емоцій!",
        },
        text13: {
            en: "We observe and rejoice in the success of each child! Winning is not easy, and losing is even harder. But everyone must face this trial. And the strong are those who, after defeat, find the opportunity to move forward and not give up.",
            ru: "Мы наблюдаем и радуемся успехам каждого ребенка! Выигрывать не легко, а проигрывать еще сложнее. Но это испытание должен пройти каждый. И сильным оказывается тот, кто после поражения находит возможность двигаться дальше и не сдаваться.",
            ua: "Спостерігаємо і радіємо успіхам кожної дитини! Вигравати нелегко, а програвати ще важче. Але це випробовування повинен пройти кожен. І сильним виявляється той, хто після програшу знаходить можливість рухатися далі і не здаватися."
        },
        text14: {
            en: "Wishing everyone enthusiasm and new opportunities, lots of joyful moments, and victories!",
            ru: "Желаем всем энтузиазма и новых возможностей, побольше радостных моментов и побед!",
            ua: "Бажаємо всім ентузіазму та нових можливостей, побільше радісних моментів та перемог!",
        },
        text15: {
            en: "Thank you, Yegor, for the support and training of our karatekas. Thanks to Ola for the organization and for being a champion! Special thanks to the parents for trusting us with your kids. Thanks to our karatekas!",
            ru: "Благодарим Егора за поддержку и тренировки для каратистов. Благодарим Олю за организацию и за чемпиона! Родителям отдельная благодарность за то, что доверяете своих деток нам. Спасибо нашим каратистам!",
            ua: "Дякуємо Єгору за підтримку та тренування каратистів. Дякуємо Олі за організацію і за чемпіона! Батькам окрема подяка за те, що довіряєте своїх діток нам. Дякуємо нашим каратистам!",
        },


        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
    },
    cupIrpin: {
        type: "cupIrpin",
        title: {
            en: "Princess Olga Cup, Irpin city",
            ru: "Кубок Княгини Ольги, г. Ирпень",
            ua: "Кубок Княгині Ольги, м. Ірпінь",
        },
        date: "03.03.2019",
        category: {
            en: "Competition",
            ru: "Состязание",
            ua: "Змагання ",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702373551/news/030319/Screenshot_21_rsvc5c.webp",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702373551/news/030319/Screenshot_22_rmn7fn.webp",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702373553/news/030319/Screenshot_24_wqfzmo.webp"
        ],
        text1: {
            en: "This Sunday, experienced fighters from our club took part in the championship of Irpin city, 'Princess Olga Cup' in Kyokushin Karate (WKO).",
            ru: "Это воскресенье опытные бойцы нашего клуба приняли участие в первенстве города Ирпень 'Кубок Княгини Ольги' по Киокушинкай карате (WKO).",
            ua: "Цієї неділі досвідчені бійці нашого клубу взяли участь у першості м.Ірпіня «Кубку Княгині Ольги» з Кіокушинкай карате (WKO).\n."
        },
        text2: {
            en: "Our karatekas fought very honorably and had 3 matches:",
            ru: "Наши каратисты сражались очень достойно и провели 3 поединка:",
            ua: "Наші каратисти билися дуже гідно та провели 3 поєдинки:",
        },
        wins1: {
            en: ["🥇 1st place — Yaroslav Hrynchenko", "🥈 2nd place — Oleg Svitlichnyi", "🥈 2nd place — Artem Tymofeev", "🏅 4th place — Ivan Vitchinov"],
            ru: ["🥇 1 место — Гринченко Ярослав", "🥈 2 место — Свитличний Олег", "🥈 2 место — Тимофеев Артем", "🏅 4 место — Витчинов Иван"],
            ua: ["🥇 1 місце — Грінченко Ярослав", "🥈 2 місце — Світличний Олег", "🥈 2 місце — Тимофеєв Артем", "🏅 4 місце — Вітчинов Іван"]
        },
        text3: {
            en: "We take pride in the success of our students! Each competition is a valuable experience! Special thanks to Sensei Yegor Sorochinsky for the work done and to the parents for their support. Together, we are a wonderful team!",
            ru: "Мы гордимся успехами наших учеников! Каждое соревнование — это большой опыт! Отдельная благодарность сенсею Егору Сорочинскому за проделанную работу и родителям за поддержку. Вместе мы замечательная команда!",
            ua: "Ми пишаємося успіхами наших учнів! Кожне змагання — це великий досвід! Окрема подяка семпаю Єгору Сорочинському за виконану роботу та батькам за підтримку. Разом ми чудова команда!",
        },
        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
    },
    shchoTakeZbory: {
        type: "shchoTakeZbory",
        title: {
            en: "What are fees and why are they needed?",
            ru: "Что такое зборы и для чего они нужны",
            ua: "Що таке збори і для чого вони потрібні",
        },
        date: "05.02.2019",
        category: {
            en: "Dojo events",
            ru: "События доджо",
            ua: "Події доджо",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702374910/news/050219/Screenshot_17_lsyqjc.webp",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702374913/news/050219/Screenshot_20_dpgjaq.webp",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702374911/news/050219/Screenshot_19_dzisa6.webp"
        ],
        text1: {
            en: "Twice a year, in summer and winter, the karatekas of the 'Misak Dojo' club participate in Training Camps under the guidance of Shihan Oleksandr Valeriyovych Honcharenko in Vinnytsia.\n" +
                "\n" +
                "Four days of intensive training + belt examinations.",
            ru: "Два раза в год, летом и зимой, каратисты клуба «Мисак Доджо» принимают участие в Учебно-тренировочных сборах под руководством шихана Олександра Валерійовича Гончаренко в Виннице.\n" +
                "\n" +
                "Четыре дня интенсивных тренировок + экзамен на пояса.",
            ua: "Двічі на рік, влітку та взимку, каратисти клубу «Місак Доджо» беруть участь у Навчально-тренувальних зборах під керівництвом шихана Олександра Валерійовича Гончаренко у Вінниці.\n" +
                "\n" +
                "Чотири дні інтенсивного тренування + екзамен на пояси.",
        },
        text2: {
            en: "<strong>Usually, during the training camps, we:</strong>\n" +
                "\n" +
                "● interact with a large number of black belts from all over Ukraine,\n" +
                "● work with karate practitioners of different levels, \n" +
                "● immerse ourselves in the culture of karate, \n" +
                "● learn new techniques,\n" +
                "● test our strength and endurance.\n",
            ru:
                "<strong>Обычно на сборах мы:</strong>\n" +
                "\n" +
                "● общаемся с большим количеством каратистов черных поясов со всей Украины,\n" +
                "● работаем с каратистами разных уровней,\n" +
                "● погружаемся в культуру карате,\n" +
                "● изучаем новые техники,\n" +
                "● проверяем себя на прочность и выносливость.\n",
            ua:
                "<strong>Зазвичай на зборах ми:</strong>\n" +
                "\n" +
                "● спілкуємося з великою кількістю чорних поясів зі всієї України,\n" +
                "● працюємо з каратистами різних рівнів,\n" +
                "● заглиблюємося у культуру карате,\n" +
                "● знайомимося з новими техніками,\n" +
                "● перевіряємо себе на міцність та витривалість.\n"
        },
        text3: {
            en: "Even this time wasn't an exception. Despite a small team and the absence of a sensei, the students took part in the Winter School 'Vinnytsia 2019.' All karatekas from the senior and middle groups successfully passed the exams: Ivan (8 kyu), Artem (9 kyu), Yura (8 kyu), Olya (9 kyu). Congratulations to the karatekas on passing the exams, and we wholeheartedly wish them success and new achievements on the path of Kyokushin karate!",
            ru: "И этот раз не стало исключением. Несмотря на небольшой состав команды и отсутствие сэнсея, ученики приняли участие в Зимней школе «Винница 2019». Все каратисты старшей и средней групп успешно сдали экзамен: Иван (8 кю), Артем (9 кю), Юра (8 кю), Оля (9 кю). Поздравляем каратистов с сдачей экзаменов и от всего сердца желаем успехов и новых достижений на пути Киокушинкай карате!",
            ua: "І цей раз не став виключенням. Хоч невеликим складом команди і без сенсея, учні взяли участь у Зимовій школі «Вінниця 2019». Всі каратисти старшої і середньої груп успішно склали іспит: Іван (8 кю), Артем (9 кю), Юра (8 кю), Оля (9 кю).Вітаємо каратистів зі здачею екзаменів та від усього серця бажаємо успіхів та нових досягнень на шляху Кіокушинкай карате!"
        },
        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
    },
    kievOpenCup: {
        type: "kievOpenCup",
        title: {
            en: "Kyiv Open Cup 2018",
            ru: "Kyiv Open Cup 2018",
            ua: "Kyiv Open Cup 2018",
        },
        date: "11.12.2018",
        category: {
            en: "Competition",
            ru: "Состязание",
            ua: "Змагання",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702377027/news/111218/Screenshot_14_pzui2o.webp",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702377029/news/111218/Screenshot_15_gtmtwu.webp",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702377031/news/111218/Screenshot_16_wdp4hh.webp"
        ],
        text1: {
            en: "This weekend, the karatekas of the 'Misak Dojo' club attended the Kyiv Open Cup 2018 competition, with the participation of 22 students from the junior, middle, and senior groups. From 9 in the morning until 6 in the evening, the karatekas competed for their results and had several matches.",
            ru: "В этот уикенд каратисты клуба «Місак Доджо» посетили соревнования Kyiv Open Cup 2018, в которых приняли участие 22 ученика из младшей, средней и старшей групп. С 9 утра до 6 вечера каратисты боролись за свои результаты и провели несколько поединков.",
            ua: "У ці вихідні каратисти клубу «Місак Доджо» відвідали змагання Kyiv Open Cup 2018, в яких взяли участь 22 учня з молодшої, середньої та старшої груп. З 9-ї ранку до 6-ї години вечора каратисти боролися за свої результати та провели по декілька поєдинків."
        },
        text2: {
            en: "<strong>And here are the results:</strong>\n" +
                "\n" +
                "● 🥇 <strong>2 gold medals</strong>\n" +
                "● 🥈 <strong>8 silver</strong>\n" +
                "● 🥉 <strong>6 bronze</strong>\n" +
                "● 🏅 <strong>4 honorary fourth places</strong>\n",
            ru:
                "<strong>И вот такие результаты:</strong>\n" +
                "\n" +
                "● 🥇 <strong>2 золотых медали</strong>\n" +
                "● 🥈 <strong>8 серебряных</strong>\n" +
                "● 🥉 <strong>6 бронзовых</strong>\n" +
                "● 🏅 <strong>4 почетных четвертых места</strong>\n",
            ua:
                "<strong>І ось маємо такий результат:</strong>\n" +
                "\n" +
                "● 🥇 <strong>2 золотих медалі</strong> \n" +
                "● 🥈 <strong>8 срібних</strong> \n" +
                "● 🥉 <strong>6 бронзових</strong> \n" +
                "● 🏅 <strong>4 почесних четвертих місця</strong> \n"
        },
        text3: {
            en: "We are proud of the results of our students, who brought the club the third team place in terms of the number of medals received among all participants of the competition.",
            ru: "Мы гордимся результатами наших учеников, которые принесли клубу третье командное место по количеству медалей среди всех участников соревнований.",
            ua: "Ми пишаємося результатами наших учнів, які принесли клубу третє командне місце за кількістю отриманих медалей серед всіх учасників змагань.",
        },
        text4: {
            en: "Thanks to the organizers for the opportunity to showcase our skills, and to the parents and the senior group karatekas for their support at the competition!",
            ru: "Спасибо организаторам за возможность проявить себя, родителям и каратистам старшей группы за помощь на соревнованиях!",
            ua: "Дякуємо організаторам за можливість проявити себе, батькам і каратистам старшої групи за допомогу на змаганнях!",
        },
        osu: {
            en: "We are a great team! OSY!",
            ru: "Мы отличная команда! Осу!",
            ua: "Ми чудова команда! Осу!"
        },
    },
    karateBegins: {
        type: "karateBegins",
        title: {
            en: "Where does karate begin?",
            ru: "С чего начинается каратэ",
            ua: "З чого починається карате",
        },
        date: "07.12.2018",
        category: {
            en: "Useful Information",
            ru: "Полезная информация",
            ua: "Корисна інформація",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702378795/news/071218/Screenshot_13_nrzwfe.webp"
        ],
        text1: {
            en: "<strong>We train not only the body but also the mind!</strong>\n" +
                "\n" +
                "During training, new students in the club often encounter surprised looks when Sensei gives specific commands. Karate is not only physical preparation and strength of character but also training of the mind. Every student should know all karate commands, be able to recognize them by ear, and execute them clearly.\n" +
                "\n" +
                "To familiarize yourself with important information that you will need during training, we have created a special section called <strong>'Read More'</strong> with all the rules, commands, terms, and interesting facts from the world of Kyokushinkai Karate.",
            ru: "<strong>Тренируем не только тело, но и разум!</strong>" +
                "\n" +
                "Во время тренировок новые ученики клуба часто сталкиваются с удивленными взглядами, когда сэнсей отдает определенные команды. Карате — это не только физическая подготовка и сила характера, но и тренировка разума. Каждый ученик должен знать все команды карате, уметь их распознавать на слух и четко выполнять.\n" +
                "\n" +
                "Для ознакомления с важной информацией, которая вам понадобится во время тренировок, мы создали специальный раздел под названием <strong>«Еще почитать»</strong> с правилами, командами, терминами и интересными фактами из мира Киокушинкай карате.",
            ua: "<strong>Тренуємо не лише тіло, а й розум!</strong>\n" +
                "\n" +
                "Під час тренувань нерідко доводиться зустрічатися зі здивованими поглядами нових учнів клубу, коли звучить певна команда від сенсея. Карате — це не лише фізична підготовка та сила характеру, а й тренування розуму. Кожен учень повинен знати всі команди карате, вміти їх розпізнавати на слух та чітко виконувати.\n" +
                "\n" +
                "Для ознайомлення з важливою інформацією, що знадобиться вам під час тренувань, ми створили спеціальний розділ під назвою <strong>«Ще почитати»</strong> з усіма правилами, командами, термінами та цікавими фактами зі світу Кіокушинкай карате."
        },
        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
    },
    candyOrLife: {
        type: "candyOrLife",
        title: {
            en: "Candy or life",
            ru: "Конфеты или жизнь",
            ua: "Цукерки або життя",
        },
        date: "06.12.2018",
        category: {
            en: "Dojo events",
            ru: "События доджо",
            ua: "Події доджо",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702380343/news/061218/Screenshot_11_o6egby.webp",
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702380345/news/061218/Screenshot_12_bikjxa.webp"
        ],
        text1: {
            en: "<strong>Halloween celebration</strong> took place at the Sports Club 'Misak Dojo'! 🎃👻\n" +
                "\n" +
                "Training is not just weekdays, sometimes it's a sea of fun, balloons, contests, and sweets!",
            ru: "<strong>Праздник Хэллоуина</strong> в Спортивном клубе «Місак Доджо» состоялся! 🎃👻\n" +
                "\n" +
                "Тренировка — это не только будни, иногда это море веселья, воздушные шары, конкурсы и сладости!",
            ua: "<strong>Свято Хелловіну</strong> у Спортивному клубі «Місак Доджо» відбулося! 🎃👻\n" +
                "\n" +
                "Тренування — це не тільки будні, іноді це море веселощів, повітряні кулі, конкурси та солодощі!"
        },
        text2: {
            en: "Thank you to everyone who took an active part in preparing for the holiday! Together we will succeed, together we are strength!",
            ru: "Спасибо всем, кто активно участвовал в подготовке к празднику! Вместе у нас все получится, вместе – мы сила!",
            ua: "Дякуємо всім, хто брав активну участь у підготовці до свята! Разом у нас все вийде, разом — ми сила!",
        },
        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
    },
    meansTeam: {
        type: "meansTeam",
        title: {
            en: "What does the team at Misak Dojo mean?",
            ru: "Что значит команда в клубе «Миссак Доджо»",
            ua: "Що означає команда у клубі «Місак Доджо»",
        },
        date: "06.12.2018",
        category: {
            en: "Useful Information",
            ru: "Полезная информация",
            ua: "Корисна інформація",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702381455/news/061218/IMG_5058_3_kgfo6o.webp",
        ],
        text1: {
            en: "<strong>We are a team</strong>:\n" +
                "\n" +
                "👊 We help newcomers integrate into our karate family\n" +
                "\n" +
                "👊 We learn from mistakes together and help each other grow\n" +
                "\n" +
                "👊 We train to become stronger and win\n" +
                "\n" +
                "👊 We support each other in competitions and during assessments\n" +
                "\n" +
                "👊 We are a team, each of us is individual, but we are one\n" +
                "\n" +
                "👊 We are all united by Kyokushin Karate",
            ru: "<strong>Мы — команда</strong>:\n" +
                "\n" +
                "👊 Мы помогаем новичкам вливаться в нашу семью карате\n" +
                "\n" +
                "👊 Мы вместе учимся на ошибках и помогаем друг другу развиваться\n" +
                "\n" +
                "👊 Мы тренируемся, чтобы становиться сильнее и побеждать\n" +
                "\n" +
                "👊 Мы поддерживаем друг друга на соревнованиях и во время аттестаций\n" +
                "\n" +
                "👊 Мы — команда, каждый из нас индивидуален, но мы едины\n" +
                "\n" +
                "👊 Нас объединяет Киокушинкай карате",
            ua: "<strong>Ми — команда</strong>:\n" +
                "\n" +
                "👊 Ми допомагаємо новачкам влитися у нашу сім'ю карате\n" +
                "\n" +
                "👊 Ми разом вчимося на помилках і допомагаємо один одному розвиватися\n" +
                "\n" +
                "👊 Ми тренуємося для того, щоб ставати сильнішими та перемагати\n" +
                "\n" +
                "👊 Ми підтримуємо один одного на змаганнях та під час атестацій\n" +
                "\n" +
                "👊 Ми — команда, кожен із нас індивідуальний, але ми єдині\n" +
                "\n" +
                "👊 Усіх нас об'єднує Кіокушинкай карате"
        },
        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
    },
    karateSea: {
        type: "karateSea",
        title: {
            en: "What can karate and the sea have in common?",
            ru: "Что может быть общего между каратэ и морем?",
            ua: "Що може бути спільного між карате та морем?",
        },
        date: "22.10.2018",
        category: {
            en: "Dojo events",
            ru: "События доджо",
            ua: "Події доджо",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702382421/news/221018/Screenshot_10_urhqvs.webp",
        ],
        text1: {
            en: "Four days at the training camp of the  \"Misak Dojo\" club in Yuzhne is the sunrise during the morning training, kata on the sandy beach, saiken on the seashell, games on the sandy slopes, swimming in the October sea, sprint running on the stairs...",
            ru: "Четыре дня на собрании клуба «Миссак Доджо» в г. Южный - это восход солнца на утренней тренировке, палача на песчаном берегу, сайкен на ракушняке, игры на песчаных склонах, купание в октябрьском море, спринтерский бег по лестнице…",
            ua: "Чотири дні на зборах клубу «Місак Доджо» у м. Южне — це схід сонця на ранковому тренуванні, ката на піщаному березі, сайкен на ракушняку, ігри на піщаних схилах, купання в жовтневому морі, спринтерський біг по сходах…"
        },
        text2: {
            en: "The training camp took place in the city of Yuzhne, Odessa region, at the health complex \"Portovik\". Adequate nutrition, a stadium by the sea—more than enough for three training sessions a day. <strong> On the first day</strong>, the night journey didn't interfere with the planned events: two training sessions and a walk on the sandy slope by the sea—DONE!",
            ru: "Сборы проходили в городе Южное, Одесской области, в оздоровительном комплексе «Портовик». Плотное питание, стадион на берегу моря — более чем достаточно для трех тренировок в день. <strong> В первый день</strong> ночная дорога не помешала запланированным событиям: две тренировки и прогулка по песчаному склону у моря — DONE!",
            ua: "Збори проходили в місті Южне, Одеської області, в оздоровчому комплексі «Портовик». Посилене харчування, стадіон на березі моря, — більш ніж достатньо для трьох тренувань на день.<strong> У перший день</strong> нічна дорога не стала на заваді запланованим подіям: два тренування та прогулянка піщаним схилом біля моря — DONE!"
        },
        text3: {
            en: "<strong>The second day </strong> was decided to diversify the usual workouts with sprinting on the stairs and swimming in the sea. Only the bravest and most daring ventured into the water.",
            ru: "<strong>Второй день </strong>решили разнообразить обычные тренировки спринтом по лестницам и купанием в море. На плавание решились самые смелые и отважные.",
            ua: "<strong>На другий день</strong> було вирішено додати до звичних тренувань спринт сходами та купання в морі. На плавання відважились найбільш відважні та сміливі."
        },
        text4: {
            en: "<strong>On the third day</strong>, the coaching staff did not give up and added to the usual training sessions a 1.5 km run to the city beach, kata, and once again swimming in the sea. After all, only the strongest survive! However, active recreation left its mark, andon the fourth day, there was only the traditional morning workout, and at noon, as a bonus, a light walk along the beach.",
            ru: "<strong>На третий день</strong> тренерский склад не здався и разбавил тренировки 1,5 км пробежкой до местного пляжа, ката и опять же купанием в море. Ведь выживают только самые сильные! Тем не менее, активный отдых оставил свой след, ичетвертый день был посвящен только традиционной утренней тренировке, а в обед - в качестве бонуса - небольшой прогулкой по пляжу.",
            ua: "<strong>На третій день</strong> тренерський склад не здався і розбавив тренування 1,5 км пробіжкою до міського пляжу, ката і знову ж купанням у морі. Адже, виживають найсильніші! Однак, активний відпочинок уніс свої корективи і четвертого дня було лише традиційне ранкове тренування, а в обід, як бонус, легка прогулянка пляжем.",
        },
        text5: {
            en: "\"Where do we get so much strength and energy for all these feats?\"  you might ask. \"Well, we are students of the 'Misak Dojo' club!\" we'll respond.",
            ru: "«Откуда у нас столько сил и энергии на все эти подвиги?» - можете спросить вы. «Ну, мы же ученики клуба 'Місак Доджо'!» - ответим мы.",
            ua: "«Звідки у нас стільки сил та енергії на всі ці подвиги?» — запитаєте ви. «Так ми ж учні клубу „Місак Доджо“!» — відповімо ми.",
        },
        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
    },
    usefulInfo: {
        type: "usefulInfo",
        title: {
            en: "Useful information for beginners",
            ru: "Полезная информация для новичков",
            ua: "Корисна інформація для новачків",
        },
        date: "10.09.2018",
        category: {
            en: "Useful Information",
            ru: "Полезная информация",
            ua: "Корисна інформація",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702390824/news/100918/IMG_5070_3_x2x2er.webp",
        ],
        text1: {
            en: "We are extremely happy and proud that our Sports Club \"Misak Dojo\" is constantly gaining new students. And the question that most often arises from parents and children who want to train with us is, \"What should a newcomer know?\"",
            ru: "Мы чрезвычайно рады и гордимся тем, что наш Спортивный клуб \"Мисак Доджо\" постоянно пополняется новыми учениками. И вопрос, который чаще всего возникает у родителей и детей, желающих тренироваться с нами, - \"Что должен знать новичок?\"",
            ua: "Ми надзвичайно раді та пишаємося тим, що наш Спортивний клуб «Місак Доджо» постійно поповнюється новими учнями. І питання, що найчастіше виникає у батьків та дітей, що хочуть тренуватися з нами — «Що повинен знати новачок?».",
        },
        title2: {
            en: "A mini-cheat sheet that will help new students join our friendly team:",
            ru: "Мини-шпаргалка, которая поможет новым ученикам влиться в нашу дружескую команду:",
            ua: "Міні-шпаргалка, що допоможе новим учням влитися у нашу дружню команду:",
        },
        label1: {
            en: "1. Greetings at the beginning of training:",
            ru: "1. Приветствие в начале тренировки:",
            ua: "1. Привітання на початку тренування:",
        },
        text3: {
            en: "● <strong>Sensei-ni-rei</strong> — respect to the teacher (sensei, trainer).\n" +
                "● <strong>Sempai-ni-rei</strong> — respect to the senior student (karateka who stands first in line).\n" +
                "● <strong>Otagai-ni-rei</strong> — mutual respect exchanged between individuals.\n" +
                "Response of students after each phrase — ● <strong>Os!</strong>",
            ru: "● <strong>Сенсей-ни-рей</strong> — уважение к учителю (сенсею, тренеру).\n" +
                "● <strong>Семпай-ни-рей</strong> — уважение к старшему ученику (каратисту, который стоит первым в строю).\n" +
                "● <strong>Отагай-ни-рей</strong> — уважение, которым обмениваются между собой.\n" +
                "● Ответ учеников после каждой фразы — <strong>Ос!</strong>",
            ua: "● <strong>Сенсей-ні-рей</strong> — уклін сенсею (вчителю, тренеру).\n" +
                "● <strong>Семпай-ні-рей</strong> — уклін старшому учню (каратист, який стоїть першим у строю).\n" +
                "● <strong>Отагай-ні-рей</strong> — уклін, яким обмінюються один з одним.\n" +
                "● Відповідь учнів після кожної фрази — <strong>Ос!</strong>\n"
        },
        label2: {
            en: "2. Farewell at the end of training:",
            ru: "2. Прощание в конце тренировки:",
            ua: "2. Прощання у кінці тренування:",
        },
        text4: {
            en: "● <strong>Sensеi-ni-arigato gozaimas'ta</strong> — bowing and thanking the sensei (teacher, trainer) for training.\n" +
                "● <strong>Sempai-ni-arigato gozaimas'ta</strong> — bowing and thanking the senior student (the karateka standing first in line) for trainingowing and thanking the senior student (the karateka standing first in line) for training.\n" +
                "● <strong> O-tagai-ni-arigato gozaimas'ta</strong> — bowing and thanking each other for training.\n" +
                "Response of students after each phrase — <strong>Os, arigato gozaimas'ta!</strong>",
            ru: "● <strong>Сенсей-ни-аригато годзаймаста — уважение и благодарность учителю (сенсею, тренеру) за тренировку.\n" +
                "● <strong>Семпай-ни-аригато годзаймаста — уважение и благодарность старшему ученику (каратисту, который стоит первым в строю) за тренировку.\n" +
                "● <strong>О-тагаи-ни-аригато годзаймаста — уважение и благодарность друг другу за тренировку.\n" +
                "Ответ учеников после каждой фразы —   <strong>Ос, аригато годзаймаста!</strong>",
            ua: "● <strong>Сенсей-ні-арігато годзаймасьта</strong> — уклін та подяка сенсею (вчителя, тренера) за тренування.\n" +
                "● <strong>Сенпай-ні-арігато годзаймасьта</strong> — уклін та подяка старшому учню (каратист, який стоїть першим у строю) за тренування.\n" +
                "● <strong>О-тагаї-ні-арігато годзаймасьта</strong> — уклін та подяка один одному за тренування.\n" +
                "Відповідь учнів після кожної фрази — <strong>Ос, арігато годзаймасьта!</strong>",
        },
        label3: {
            en: "3. The score in the warm-up:",
            ru: "3. Счет на разминке:",
            ua: "3. Рахунок на розминці:",
        },
        text5: {
            en: "Ichi, — 1,\n" +
                "Ni — 2,\n" +
                "San — 3,\n" +
                "Chi — 4,\n" +
                "Go — 5,\n" +
                "Roku — 6,\n" +
                "Sichi — 7,\n" +
                "Hachi — 8,\n" +
                "Ku — 9,\n" +
                "Dzyu — 10.",
            ru: "Ич — 1,\n" +
                "Ни — 2,\n" +
                "Сан — 3,\n" +
                "Чи — 4,\n" +
                "Го — 5,\n" +
                "Року — 6,\n" +
                "Сичи — 7,\n" +
                "Хачи — 8,\n" +
                "Ку — 9,\n" +
                "Дзю — 10.",
            ua: "Іч — 1,\n" +
                "Ні — 2\n" +
                "Сан — 3,\n" +
                "Чі — 4,\n" +
                "Го — 5,\n" +
                "Року — 6,\n" +
                "Січі — 7,\n" +
                "Хачі — 8,\n" +
                "Ку — 9,\n" +
                "Дзю — 10.",
        },
        osu: {
            en: "Good luck and we look forward to training!",
            ru: "Удачи и ждем на тренировках!",
            ua: "Щасти та чекаємо на тренуваннях!"
        },
    },
    openChampionship: {
        type: "openChampionship",
        title: {
            en: "The championship of SC \"Fighter\" 2018 is open",
            ru: "Открытое первенство СК «Файтер» 2018",
            ua: "Відкрита першість СК «Файтер» 2018",
        },
        date: "22.05.2018",
        category: {
            en: "Competition",
            ru: "Состязание",
            ua: "Змагання",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702394601/news/220518/Screenshot_5_alaoxm.webp",
        ],
        text1: {
            en: "On May 20, the <strong>SK Fighter</strong> competition took place among children aged 6-12. Eight athletes from the Sports Club 'Misak Dojo' also participated.",
            ru: "20 мая прошли соревнования <strong>СК Файтер</strong> среди детей в возрасте 6−12 лет. В них также участвовали 8 спортсменов Спортивного клуба «Мисак Доджо».",
            ua: "20 травня пройшли змагання <strong>СК Файтер</strong> серед дітей віком 6−12 років. Учасниками також стали 8 спортсменів Спортивного клубу «Місак Доджо»."
        },
        text2: {
            en: "Victories achieved by our team:\n" +
                "\n" +
                "● 🥇 1st place — Danilo Keybal. Excellent debut!\n" +
                "● 🥇 1st place — Artem Timofeev. Second competition where the championship in the 6 years up to 30 kg category was confirmed!\n" +
                "● 🥈 2nd place — Oleg Svitlychny. Good debut, shared prize places in the 6 years up to 30 kg category with Artem!\n" +
                "● 🥈 3rd place — Ivan Vitchinov. First competition, won a prize place after the first lost fight. Good result!\n" +
                "● 🏅 4th place — Maxim Loginov. Second competition, fought well with hard and precise strikes, using various techniques. Next time we will definitely bring victory!\n" +
                "● 🏅 4th place — Yaroslav Hrinchenko. First competition, first experience: lost mawashi, adjusting the helmet during the match. Made conclusions, next time such a thing will not happen on the tatami. Going for victory!\n" +
                "● 🏅 4th place — Bohdan Lukashchuk. First competition, where he showed himself excellently. Cool hit with maeva geri at the end of the match, but it was not counted. So we train more to win cleanly!\n" +
                "\n" +
                "● 🏅 4th place — Yevhenii Vasilevskyi. Second competition, where a little pressure was missing. We will work on powerful strikes so that the judges have no questions in evaluating clean and precise hits!\n" +
                "\n" +
                "All the kids did great, showed themselves excellently on the tatami. Special thanks to those who came to support our team!\n" +
                "From the competition, we brought 2 first places, 1 second place, 1 third place, and 4 fourth places. All the students of the club showed themselves very worthy. Someone had stronger opponents, someone had weaker ones, but everyone did great! We gained a huge experience and understood what we need to work on and what to aim for next.\n" +
                "\n" +
                "We continue to work in the same spirit! We find an opportunity to attend not only workouts but also meetings, competitions, and other sports events. Every hour of spent time brings us closer to victory over ourselves, over the opponent, over laziness, over the tablet, and other not very useful things:) Medals are a reward for your efforts!",
            ru: "Победы, достигнутые нашей командой:\n" +
                "\n" +
                "● 🥇 1 место — Данило Кейбал. Отличный дебют!\n" +
                "● 🥇 1 место — Артем Тимофеев. Вторые соревнования, на которых подтвердилось первенство в категории 6 лет до 30 кг!\n" +
                "● 🥈 2 место — Олег Свитличный. Хороший дебют, поделил призовые места в категории 6 лет до 30 кг с Артемом!\n" +
                "● 🥈 3 место — Иван Витчинов. Первые соревнования, завоевал призовое место после первого проигранного боя. Хороший результат!\n" +
                "● 🏅 4 место — Максим Логинов. Вторые соревнования, сражался отлично, с жесткими и четкими ударами, используя разнообразную технику. В следующий раз обязательно привезем победу!\n" +
                "● 🏅 4 место — Ярослав Гринченко. Первые соревнования, первый опыт: потеряли маваши, поправляя шлем во время поединка. Сделали выводы, в следующий раз на татами такого не повторится. Идем к победе!\n" +
                "● 🏅 4 место — Богдан Лукащук. Первые соревнования, на которых отлично проявил себя. Круто ударил маев гери в конце поединка, но не засчитали. Так что тренируемся больше, чтобы побеждать чисто!\n" +
                "\n" +
                "● 🏅 4 место — Евгений Василевский. Вторые соревнования, на которых немного не хватило натиска. Будем работать над гарматными ударами, чтобы у судей не возникало вопросов в оценке чистых и четких ударов!\n" +
                "\n" +
                "Все дети молодцы, отлично проявили себя на татами. Отдельная благодарность тем, кто пришел поддержать нашу команду!\n" +
                "С соревнований мы привезли 2 первых места, 1 второе место, 1 третье место и 4 четвертых места. Все ученики клуба проявили себя очень достойно. У кого-то соперники были сильнее, у кого-то — слабее, но все молодцы! Мы получили огромный опыт и поняли, над чем нам работать и чего достигать дальше.\n" +
                "\n" +
                "Продолжаем работать в таком же духе! Находим возможность посещать не только тренировки, но и собрания, соревнования и другие спортивные мероприятия. Каждый час затраченного времени приближает нас к победе над собой, над соперником, над ленью, над планшетом и другими не очень полезными вещами:) Медали — это награда за ваши усилия!",
            ua: "Перемоги, які здобула наша команда:\n" +
                "\n" +
                "● 🥇 1 місце — Данило Кейбал. Чудовий дебют!\n" +
                "● 🥇 1 місце — Артем Тимофеєв. Друге змагання, на якому підтвердилося чемпіонство у категорії 6 років до 30 кг!\n" +
                "● 🥈 2 місце — Олег Світличний. Хороший дебют, розділили з Артемом призові місця в категорії 6 років до 30 кг!\n" +
                "● 🥈 3 місце — Іван Вітчинов. Перше змагання, завоював призове місце після першого програшного бою. Хороший результат!\n" +
                "● 🏅 4 місце — Максим Логінов. За рахунком вже друге змагання, бився чудово, з жорсткими та чіткими ударами, використовуючи різноманітну техніку. Наступного разу обов’язково привеземо перемогу!\n" +
                "● 🏅 4 місце — Ярослав Грінченко. Перше змагання, перший досвід: проґавили маваші, поправляючи шолом під час поєдинку. Висновки зробили, наступного разу на татамі такого не повториться. Йдемо до перемоги!\n" +
                "● 🏅 4 місце — Богдан Лукащук. Перше змагання, на яких чудово себе проявив. Круто вдарив має гері у кінці поєдинку, але не зарахували. Тому тренуємося більше, щоб перемагати чисто!\n" +
                "\n" +
                "● 🏅 4 місце — Євгеній Василевський. Друге змагання, на якому трохи не вистачило натиску. Працюватимемо над гарматними ударами, щоб у суддів не виникало питань в оцінці чистих і чітких ударів!\n" +
                "\n" +
                "Усі діти молодці, чудово проявили себе на татамі. Окрема подяка тим, хто прийшов повболівати за нашу команду!\n" +
                "Зі змагань ми привезли 2 перших місця, 1 друге місце, 1 3 місце і 4 четвертих місця. Всі учні клубу проявили себе дуже гідно. У когось суперники були сильніші, у когось — слабші, проте всі молодці! Ми отримали величезний досвід і зрозуміли над чим нам працювати та чого прагнути далі.\n" +
                "\n" +
                "Продовжуємо працювати у такому ж дусі! Знаходимо можливість відвідувати не тільки тренування, але і зібрання, змагання та інші спортивні події.Кожна година витраченого часу, наближує нас до перемоги над собою, над суперником, над лінню, над планшетом та іншими не дуже корисними речами:)Медалі — це нагорода за ваші зусилля! ",
        },
        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
    },
    enerkid: {
        type: "enerkid",
        title: {
            en: "Enerkid Cup 2018",
            ru: "Кубок Enerkid 2018",
            ua: "Кубок Enerkid 2018",
        },
        date: "25.04.2018",
        category: {
            en: "Competition",
            ru: "Состязание",
            ua: "Змагання",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702396014/news/250418/Screenshot_7_rgsgj7.webp",
        ],
        text1: {
            en: "On April 21, the \"Misak Dojo\" team participated in the Energym Cup in Kyokushinkai karate \"Enerkid 2018.\"\n" +
                "\n" +
                "For the first time on the competitive tatami, 6 individuals competed:\n" +
                "\n" +
                "● 🥇 1st place — Yevhenii Vasilevskyi. Early victory with two waza-ari.\n" +
                "● 🥇 1st place — Artem Tymofiev. Two matches, victory by judges' decision.\n" +
                "● 🥈 2nd place — Hlib Shevchenko. Fought against a tough opponent.\n" +
                "● 🥉 3rd place — Yegor Konovalov. Got a bit confused, but next time we will definitely bring the victory.\n" +
                "● 🏅 4th place — Maxim Loginov. Lost the first fight, but redeemed himself in the second.\n" +
                "● 🏅 4th place — Bohdan Heneralov. Well done, was the smallest in weight, but fought bravely.",
            ru: "21 апреля команда \"Місак Доджо\" участвовала в кубке Energym по Кіокушинкай карате \"Enerkid 2018\".\n" +
                "\n" +
                "Впервые на соревновательном татами боролись 6 человек:\n" +
                "\n" +
                "● 🥇 1 место — Евгений Василевский. Досрочная победа двумя ваза-ари.\n" +
                "● 🥇 1 место — Артем Тимофеев. Два поединка, победа решением судей.\n" +
                "● 🥈 2 место — Гліб Шевченко. Сражался с трудным соперником.\n" +
                "● 🥉 3 место — Егор Коновалов. Немного растерялся, но в следующий раз обязательно привезем победу.\n" +
                "● 🏅 4 место — Максим Логінов. Проиграл первый бой, но во втором реабилитировался.\n" +
                "● 🏅 4 место — Богдан Генералов. Молодец, был самым маленьким по весу, но сражался отважно.",
            ua: "21 квітня команда «Місак Доджо» взяла участь в кубку Energym по Кіокушинкай карате «Enerkid 2018».\n" +
                "\n" +
                "Вперше на змагальному татамі боролися 6 осіб:\n" +
                "● 🥇 1 місце — Євгеній Василевський. Дострокова перемога двома ваза-арі.\n" +
                "● 🥇 1 місце — Артем Тимофеєв. Два поєдинку, перемога за рішенням суддів.\n" +
                "● 🥈 2 місце — Гліб Шевченко. Змагався з непростим суперником.\n" +
                "● 🥉 3 місце — Єгор Коновалов. Трішки розгубився, але наступного разу обов’язково привеземо перемогу.\n" +
                "● 🏅 4 місце — Максим Логінов. Перший бій програв, але у другому реабілітувався.\n" +
                "● 🏅 4 місце — Богдан Генералов. Молодець, був найменший у вазі, але бився відважно."
        },
        text2: {
            en: "All the karatekas are well done, they gave their all and came out on the tatami mat.",
            ru: "Все каратисты молодцы, выложились по полной и вышли на татами.",
            ua: "Усі каратисти молодці, виклалися на повну і вийшли на татамі.",
        },
        text3: {
            en: "We train further and go to victory!",
            ru: "Тренируемся дальше и идем к победам!",
            ua: "Тренуємося далі і йдемо до перемог!",
        },
        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
    },
    championship2018: {
        type: "championship2018",
        title: {
            en: "Championship of Ukraine 2018",
            ru: "Чемпионат Украины 2018",
            ua: "Чемпіонат України 2018",
        },
        date: "05.03.2018",
        category: {
            en: "Competition",
            ru: "Состязание",
            ua: "Змагання",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702397284/news/050318/Screenshot_8_x9mwfe.webp",
        ],
        text1: {
            en: "On March 4, the Ukrainian Kyokushinkai Karate Championship (WKO ShinKyokushinkai) among men and women in the kumite and kata section was held in the city of Chornomorsk (Odesa region).",
            ru: "4 марта в городе Черноморское (Одесская область) прошел чемпионат Украины по Киокушинкай карате (WKO ShinKyokushinkai) среди мужчин и женщин в разделе кумите и ката.",
            ua: "4 березня в місті Чорноморське (Одеська область) пройшов чемпіонат України по Кіокушинкай карате (WKO ShinKyokushinkai) серед чоловіків та жінок в розділі куміте та ката.",
        },
        text2: {
            en: "The tournament was a qualifier for the European Championship, which will be held on May 11-12, 2018 in the city of Wroclaw (Poland).",
            ru: "Турнир был отборочным на чемпионат Европы, который пройдет 11-12 мая 2018 в городе Вроцлав (Польша).",
            ua: "Турнір був відбірковим на чемпіонат Європи, який пройде 11−12 травня 2018 року в місті Вроцлав (Польща).",
        },
        text3: {
            en: "You can read more about the matches at the men's championship in the 75 kg category here:",
            ru: "Больше о поединках на чемпионате среди мужчин в категории 75 кг вы можете прочитать здесь:",
            ua: "Більше про поєдинки на чемпіонаті серед чоловіків в категорії 75 кг ви можете прочитати тут: ",
        },
        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
    },
    dojoSempai: {
        type: "dojoSempai",
        title: {
            en: "In the dojo of Senpai Oleksandr Korolev",
            ru: "У доджо у семпая Александра Королева",
            ua: "У доджо в семпая Олександра Корольова",
        },
        date: "19.11.2017",
        category: {
            en: "Dojo events",
            ru: "События доджо",
            ua: "Події доджо",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702403846/news/191117/Screenshot_9_jhy7nb.webp",
        ],
        text1: {
            en: "18th November, <strong> the karatekas of the Sports Section Kyokushin Karate \"Misak Dojo\" visited the dojo of Senpai Alexander Korolov </strong> for the first time, stepping outside the confines of their own training hall.",
            ru: "18 ноября <strong> каратисты Спортивной секции Киокушинкай карате \"Мисак Доджо\" посетили доджо семпая Александра Королева. </strong>Спортсмены впервые вышли за пределы своего зала.",
            ua: "18 листопада <strong> каратисти Спортивної секції Кіокушинкай карате «Місак Доджо» відвідали доджо семпая Олександра Корольова.</strong> Спортсмени вперше вийшли за межі свого залу."
        },
        text2: {
            en: "<strong>Bohdan Lukashchuk, Zhenya Vasylevskyi, Yaroslav Grinchenko, and Danylo Keibal stood in line with Oleksandr's students.</strong> The training took place in a friendly atmosphere. The set tasks were completed: the karate players completed the entire training, demonstrated their character and successfully performed kumite.",
            ru: "<strong> Богдан Лукащук, Женя Василевський, Ярослав Грінченко, и Данило Кейбал встали в ряд с учениками Олександра.</strong> Тренировка прошла в дружественной атмосфере. Поставленные задачи были выполнены: каратисты отработали весь тренинг, продемонстрировали характер и успешно провели кумитэ.",
            ua: "<strong>Богдан Лукащук, Женя Василевський, Ярослав Грінченко та Данило Кейбал стали в ряд з учнями Олександра.</strong> Тренування пройшло у дружній атмосфері. Поставлені задачі були виконані: каратисти відпрацювали все тренування, проявили характер і відстояли куміте.",
        },
        text3: {
            en: "The training session concluded, and our team was graciously invited for a tea gathering. The parents of the karatekas from Alexander's dojo treated everyone to hot beverages and snacks. Casual conversations brought closer both the parents and athletes from both clubs: Alexander Korolev's and Misak Arzumanyan's.",
            ru: "Тренировка завершилась, и нашу команду любезно пригласили на чаепитие. Родители каратистов из доджо Олександра угостили всех горячими напитками и угощениями. Общение в неформальной обстановке сблизило как родителей, так и спортсменов обоих клубов: Олександра Корольова и Мисака Арзуманяна.",
            ua: "Тренування закінчилося і нашу команду люб’язно запросили на чаювання. Батьки каратистів із доджо Олександра пригостили всіх гарячими напоями та смаколиками. Спілкування в неформальній обстановці зблизили і батьків і спортсменів обох клубів: Олександра Корольова та Місака Арзуманяна.",
        },
        text4: {
            en: "Thank you for the warm welcome.",
            ru: "Спасибо за теплый прием.",
            ua: "Дякуємо за теплий прийом.",
        },
        osu: {
            en: "OSY!",
            ru: "ОСУ!",
            ua: "ОСУ!"
        },
    },
    vygnanecz:{
        type: "vygnanecz",
        title: {
            en: "The Exile is a short film",
            ru: "Изгнанник — короткометражный фильм",
            ua: "Вигнанець — короткометражний фільм",
        },
        date: "01.10.2017",
        category: {
            en: "Useful Information",
            ru: "Полезная информация",
            ua: "Корисна інформація",
        },
        images: [
            "https://res.cloudinary.com/dxdwrjw7w/image/upload/v1702405328/news/011017/screenshot_1_ikuyjn.avif",
        ],
        text1: {
            en: "We recommend watching this short film.",
            ru: "Советуем посмотреть этот короткометражный фильм.",
            ua: "Радимо переглянути цей короткометражний фільм."
        },
    }

}